[Survived] BlockStatement
hello-world-nest/hello-world-nest/src/app.controller.ts:9:22
   constructor(private readonly appService: AppService) {}
 
   @Get()
-  getHello(): string {
-    return this.appService.getHello();
-  }
+  getHello(): string {}
 }
 
