[Survived] BlockStatement
hello-world-nest/src/helpers/array-helper.ts:5:14
   public static containsAllElements(
     sample: string[],
     target: string[],
-  ): boolean {
-    return target.every(element => sample.includes(element));
-  }
+  ): boolean {}
 
   public static isEmpty(target: any[]): boolean {

[Survived] ArrowFunction
hello-world-nest/src/helpers/array-helper.ts:6:25
     sample: string[],
     target: string[],
   ): boolean {
-    return target.every(element => sample.includes(element));
+    return target.every(() => undefined);
   }
 

[Survived] BlockStatement
hello-world-nest/src/helpers/array-helper.ts:9:49
     return target.every(element => sample.includes(element));
   }
 
-  public static isEmpty(target: any[]): boolean {
-    return target != null && target.length > 0;
-  }
+  public static isEmpty(target: any[]): boolean {}
 }
 

[Survived] EqualityOperator
hello-world-nest/src/helpers/array-helper.ts:10:30
   }
 
   public static isEmpty(target: any[]): boolean {
-    return target != null && target.length > 0;
+    return target != null && target.length <= 0;
   }
 }

[Survived] ConditionalExpression
hello-world-nest/src/helpers/array-helper.ts:10:12
   }
 
   public static isEmpty(target: any[]): boolean {
-    return target != null && target.length > 0;
+    return true && target.length > 0;
   }
 }
