[Survived] BlockStatement
hello-world-nest/src/helpers/date-helper.ts:2:51
 export class DateHelper {
-  static equal(date1: Date, date2: Date): boolean {
-    return (
-      date1.getDay() == date2.getDay() &&
-      date1.getMonth() == date2.getMonth() &&
-      date1.getFullYear() == date2.getFullYear()
-    );
-  }
+  static equal(date1: Date, date2: Date): boolean {}
 }
 

[Survived] EqualityOperator
hello-world-nest/src/helpers/date-helper.ts:4:7
 export class DateHelper {
   static equal(date1: Date, date2: Date): boolean {
     return (
-      date1.getDay() == date2.getDay() &&
+      date1.getDay() != date2.getDay() &&
       date1.getMonth() == date2.getMonth() &&
       date1.getFullYear() == date2.getFullYear()

[Survived] ConditionalExpression
hello-world-nest/src/helpers/date-helper.ts:4:7
 export class DateHelper {
   static equal(date1: Date, date2: Date): boolean {
     return (
-      date1.getDay() == date2.getDay() &&
-      date1.getMonth() == date2.getMonth() &&
-      date1.getFullYear() == date2.getFullYear()
+      true
     );
   }

[Survived] ConditionalExpression
hello-world-nest/src/helpers/date-helper.ts:5:7
   static equal(date1: Date, date2: Date): boolean {
     return (
       date1.getDay() == date2.getDay() &&
-      date1.getMonth() == date2.getMonth() &&
+      false &&
       date1.getFullYear() == date2.getFullYear()
     );

[Survived] EqualityOperator
hello-world-nest/src/helpers/date-helper.ts:5:7
   static equal(date1: Date, date2: Date): boolean {
     return (
       date1.getDay() == date2.getDay() &&
-      date1.getMonth() == date2.getMonth() &&
+      date1.getMonth() != date2.getMonth() &&
       date1.getFullYear() == date2.getFullYear()
     );

[Survived] ConditionalExpression
hello-world-nest/src/helpers/date-helper.ts:6:7
     return (
       date1.getDay() == date2.getDay() &&
       date1.getMonth() == date2.getMonth() &&
-      date1.getFullYear() == date2.getFullYear()
+      false
     );
   }

[Survived] ConditionalExpression
hello-world-nest/src/helpers/date-helper.ts:6:7
     return (
       date1.getDay() == date2.getDay() &&
       date1.getMonth() == date2.getMonth() &&
-      date1.getFullYear() == date2.getFullYear()
+      true
     );
   }
