[Survived] BlockStatement
hello-world-nest/hello-world-nest/src/app.service.ts:5:22
 
 @Injectable()
 export class AppService {
-  getHello(): string {
-    return 'Hello World!';
-  }
+  getHello(): string {}
 }
 

[Survived] StringLiteral
hello-world-nest/hello-world-nest/src/app.service.ts:6:12
 @Injectable()
 export class AppService {
   getHello(): string {
-    return 'Hello World!';
+    return "";
   }
 }
