[Survived] ArrowFunction
hello-world-nest/src/helpers/filter-helper.ts:6:23
     collection,
     objectFilter,
     customMatcher = {},
-    customCondition = (el) => true,
+    customCondition = () => undefined,
     sortingObj?
   ) {

[Survived] BooleanLiteral
hello-world-nest/src/helpers/filter-helper.ts:6:31
     collection,
     objectFilter,
     customMatcher = {},
-    customCondition = (el) => true,
+    customCondition = (el) => false,
     sortingObj?
   ) {

[Survived] BlockStatement
hello-world-nest/src/helpers/filter-helper.ts:8:5
     customMatcher = {},
     customCondition = (el) => true,
     sortingObj?
-  ) {
-    var result = collection.filter((el) => {
-      var match = FilterHelper.applyMatch(el, objectFilter, customMatcher);
-      match = match && customCondition(el);
-      return match;
-    });
-    if (sortingObj && sortingObj.direction) {
-      result = result.sort(FilterHelper.getSortingFunction(sortingObj));
-    }
-    return result;
-  }
+  ) {}
 
   private static applyMatch(object, objectFilter, matcher) {

[Survived] BlockStatement
hello-world-nest/src/helpers/filter-helper.ts:9:44
     customCondition = (el) => true,
     sortingObj?
   ) {
-    var result = collection.filter((el) => {
-      var match = FilterHelper.applyMatch(el, objectFilter, customMatcher);
-      match = match && customCondition(el);
-      return match;
-    });
+    var result = collection.filter((el) => {});
     if (sortingObj && sortingObj.direction) {
       result = result.sort(FilterHelper.getSortingFunction(sortingObj));

[Survived] ConditionalExpression
hello-world-nest/src/helpers/filter-helper.ts:11:15
   ) {
     var result = collection.filter((el) => {
       var match = FilterHelper.applyMatch(el, objectFilter, customMatcher);
-      match = match && customCondition(el);
+      match = true;
       return match;
     });

[Survived] LogicalOperator
hello-world-nest/src/helpers/filter-helper.ts:11:15
   ) {
     var result = collection.filter((el) => {
       var match = FilterHelper.applyMatch(el, objectFilter, customMatcher);
-      match = match && customCondition(el);
+      match = match || customCondition(el);
       return match;
     });

[Survived] BlockStatement
hello-world-nest/src/helpers/filter-helper.ts:14:45
       match = match && customCondition(el);
       return match;
     });
-    if (sortingObj && sortingObj.direction) {
-      result = result.sort(FilterHelper.getSortingFunction(sortingObj));
-    }
+    if (sortingObj && sortingObj.direction) {}
     return result;
   }

[Survived] LogicalOperator
hello-world-nest/src/helpers/filter-helper.ts:14:9
       match = match && customCondition(el);
       return match;
     });
-    if (sortingObj && sortingObj.direction) {
+    if (sortingObj || sortingObj.direction) {
       result = result.sort(FilterHelper.getSortingFunction(sortingObj));
     }

[Survived] ConditionalExpression
hello-world-nest/src/helpers/filter-helper.ts:22:14
 
   private static applyMatch(object, objectFilter, matcher) {
     var filterKeys = Object.keys(objectFilter).filter(
-      (k) => objectFilter[k] != null && object[k] !== undefined
+      (k) => true
     );
     var match = true;

[Survived] ConditionalExpression
hello-world-nest/src/helpers/filter-helper.ts:22:14
 
   private static applyMatch(object, objectFilter, matcher) {
     var filterKeys = Object.keys(objectFilter).filter(
-      (k) => objectFilter[k] != null && object[k] !== undefined
+      (k) => true && object[k] !== undefined
     );
     var match = true;

[Survived] BooleanLiteral
hello-world-nest/src/helpers/filter-helper.ts:24:17
     var filterKeys = Object.keys(objectFilter).filter(
       (k) => objectFilter[k] != null && object[k] !== undefined
     );
-    var match = true;
+    var match = false;
     filterKeys.forEach((key) => {
       if (Array.isArray(objectFilter[key])) {

[Survived] BlockStatement
hello-world-nest/src/helpers/filter-helper.ts:25:33
       (k) => objectFilter[k] != null && object[k] !== undefined
     );
     var match = true;
-    filterKeys.forEach((key) => {
-      if (Array.isArray(objectFilter[key])) {
-        var matcharray = false;
-        for (let index = 0; index < objectFilter[key].length; index++) {
-          matcharray =
-            matcharray ||
-            (matcher[key]
-              ? matcher[key](object[key], objectFilter[key][index])
-              : object[key] == objectFilter[key][index]);
-        }
-        match = match && matcharray;
-      } else {
-        match =
-          match &&
-          (matcher[key]
-            ? matcher[key](object[key], objectFilter[key])
-            : object[key] == objectFilter[key]);
-      }
-    });
+    filterKeys.forEach((key) => {});
 
     return match;

[Survived] ConditionalExpression
hello-world-nest/src/helpers/filter-helper.ts:26:11
     );
     var match = true;
     filterKeys.forEach((key) => {
-      if (Array.isArray(objectFilter[key])) {
+      if (true) {
         var matcharray = false;
         for (let index = 0; index < objectFilter[key].length; index++) {

[Survived] BlockStatement
hello-world-nest/src/helpers/filter-helper.ts:26:45
     );
     var match = true;
     filterKeys.forEach((key) => {
-      if (Array.isArray(objectFilter[key])) {
-        var matcharray = false;
-        for (let index = 0; index < objectFilter[key].length; index++) {
-          matcharray =
-            matcharray ||
-            (matcher[key]
-              ? matcher[key](object[key], objectFilter[key][index])
-              : object[key] == objectFilter[key][index]);
-        }
-        match = match && matcharray;
-      } else {
+      if (Array.isArray(objectFilter[key])) {} else {
         match =
           match &&

[Survived] BooleanLiteral
hello-world-nest/src/helpers/filter-helper.ts:27:26
     var match = true;
     filterKeys.forEach((key) => {
       if (Array.isArray(objectFilter[key])) {
-        var matcharray = false;
+        var matcharray = true;
         for (let index = 0; index < objectFilter[key].length; index++) {
           matcharray =

[Survived] EqualityOperator
hello-world-nest/src/helpers/filter-helper.ts:28:29
     filterKeys.forEach((key) => {
       if (Array.isArray(objectFilter[key])) {
         var matcharray = false;
-        for (let index = 0; index < objectFilter[key].length; index++) {
+        for (let index = 0; index >= objectFilter[key].length; index++) {
           matcharray =
             matcharray ||

[Survived] UpdateOperator
hello-world-nest/src/helpers/filter-helper.ts:28:63
     filterKeys.forEach((key) => {
       if (Array.isArray(objectFilter[key])) {
         var matcharray = false;
-        for (let index = 0; index < objectFilter[key].length; index++) {
+        for (let index = 0; index < objectFilter[key].length; index--) {
           matcharray =
             matcharray ||

[Survived] LogicalOperator
hello-world-nest/src/helpers/filter-helper.ts:30:13
         var matcharray = false;
         for (let index = 0; index < objectFilter[key].length; index++) {
           matcharray =
-            matcharray ||
-            (matcher[key]
-              ? matcher[key](object[key], objectFilter[key][index])
-              : object[key] == objectFilter[key][index]);
+            matcharray && (matcher[key] ? matcher[key](object[key], objectFilter[key][index]) : object[key] == objectFilter[key][index]);
         }
         match = match && matcharray;

[Survived] ConditionalExpression
hello-world-nest/src/helpers/filter-helper.ts:30:13
         var matcharray = false;
         for (let index = 0; index < objectFilter[key].length; index++) {
           matcharray =
-            matcharray ||
-            (matcher[key]
-              ? matcher[key](object[key], objectFilter[key][index])
-              : object[key] == objectFilter[key][index]);
+            true;
         }
         match = match && matcharray;

[Survived] ConditionalExpression
hello-world-nest/src/helpers/filter-helper.ts:33:17
             matcharray ||
             (matcher[key]
               ? matcher[key](object[key], objectFilter[key][index])
-              : object[key] == objectFilter[key][index]);
+              : true);
         }
         match = match && matcharray;

[Survived] ConditionalExpression
hello-world-nest/src/helpers/filter-helper.ts:33:17
             matcharray ||
             (matcher[key]
               ? matcher[key](object[key], objectFilter[key][index])
-              : object[key] == objectFilter[key][index]);
+              : false);
         }
         match = match && matcharray;

[Survived] LogicalOperator
hello-world-nest/src/helpers/filter-helper.ts:35:17
               ? matcher[key](object[key], objectFilter[key][index])
               : object[key] == objectFilter[key][index]);
         }
-        match = match && matcharray;
+        match = match || matcharray;
       } else {
         match =

[Survived] ConditionalExpression
hello-world-nest/src/helpers/filter-helper.ts:35:17
               ? matcher[key](object[key], objectFilter[key][index])
               : object[key] == objectFilter[key][index]);
         }
-        match = match && matcharray;
+        match = true;
       } else {
         match =

[Survived] BlockStatement
hello-world-nest/src/helpers/filter-helper.ts:36:14
               : object[key] == objectFilter[key][index]);
         }
         match = match && matcharray;
-      } else {
-        match =
-          match &&
-          (matcher[key]
-            ? matcher[key](object[key], objectFilter[key])
-            : object[key] == objectFilter[key]);
-      }
+      } else {}
     });
 

[Survived] ConditionalExpression
hello-world-nest/src/helpers/filter-helper.ts:38:11
         match = match && matcharray;
       } else {
         match =
-          match &&
-          (matcher[key]
-            ? matcher[key](object[key], objectFilter[key])
-            : object[key] == objectFilter[key]);
+          true;
       }
     });

[Survived] ConditionalExpression
hello-world-nest/src/helpers/filter-helper.ts:38:11
         match = match && matcharray;
       } else {
         match =
-          match &&
-          (matcher[key]
-            ? matcher[key](object[key], objectFilter[key])
-            : object[key] == objectFilter[key]);
+          false;
       }
     });

[Survived] ConditionalExpression
hello-world-nest/src/helpers/filter-helper.ts:41:15
           match &&
           (matcher[key]
             ? matcher[key](object[key], objectFilter[key])
-            : object[key] == objectFilter[key]);
+            : true);
       }
     });

[Survived] EqualityOperator
hello-world-nest/src/helpers/filter-helper.ts:41:15
           match &&
           (matcher[key]
             ? matcher[key](object[key], objectFilter[key])
-            : object[key] == objectFilter[key]);
+            : object[key] != objectFilter[key]);
       }
     });

[Survived] BlockStatement
hello-world-nest/src/helpers/filter-helper.ts:48:49
     return match;
   }
 
-  private static getSortingFunction(sortingObj) {
-    if (sortingObj.isDate) {
-      if (sortingObj.direction == 'DESC') {
-        return (l, r) =>
-          new Date(l[sortingObj.field]) > new Date(r[sortingObj.field])
-            ? -1
-            : 1;
-      } else if (sortingObj.direction == 'ASC') {
-        return (l, r) =>
-          new Date(r[sortingObj.field]) > new Date(l[sortingObj.field])
-            ? -1
-            : 1;
-      }
-    }
-  }
+  private static getSortingFunction(sortingObj) {}
 }
 

[Survived] BlockStatement
hello-world-nest/src/helpers/filter-helper.ts:49:28
   }
 
   private static getSortingFunction(sortingObj) {
-    if (sortingObj.isDate) {
-      if (sortingObj.direction == 'DESC') {
-        return (l, r) =>
-          new Date(l[sortingObj.field]) > new Date(r[sortingObj.field])
-            ? -1
-            : 1;
-      } else if (sortingObj.direction == 'ASC') {
-        return (l, r) =>
-          new Date(r[sortingObj.field]) > new Date(l[sortingObj.field])
-            ? -1
-            : 1;
-      }
-    }
+    if (sortingObj.isDate) {}
   }
 }

[Survived] ConditionalExpression
hello-world-nest/src/helpers/filter-helper.ts:49:9
   }
 
   private static getSortingFunction(sortingObj) {
-    if (sortingObj.isDate) {
+    if (true) {
       if (sortingObj.direction == 'DESC') {
         return (l, r) =>

[Survived] EqualityOperator
hello-world-nest/src/helpers/filter-helper.ts:50:11
 
   private static getSortingFunction(sortingObj) {
     if (sortingObj.isDate) {
-      if (sortingObj.direction == 'DESC') {
+      if (sortingObj.direction != 'DESC') {
         return (l, r) =>
           new Date(l[sortingObj.field]) > new Date(r[sortingObj.field])

[Survived] BlockStatement
hello-world-nest/src/helpers/filter-helper.ts:50:43
 
   private static getSortingFunction(sortingObj) {
     if (sortingObj.isDate) {
-      if (sortingObj.direction == 'DESC') {
-        return (l, r) =>
-          new Date(l[sortingObj.field]) > new Date(r[sortingObj.field])
-            ? -1
-            : 1;
-      } else if (sortingObj.direction == 'ASC') {
+      if (sortingObj.direction == 'DESC') {} else if (sortingObj.direction == 'ASC') {
         return (l, r) =>
           new Date(r[sortingObj.field]) > new Date(l[sortingObj.field])

[Survived] ArrowFunction
hello-world-nest/src/helpers/filter-helper.ts:51:16
   private static getSortingFunction(sortingObj) {
     if (sortingObj.isDate) {
       if (sortingObj.direction == 'DESC') {
-        return (l, r) =>
-          new Date(l[sortingObj.field]) > new Date(r[sortingObj.field])
-            ? -1
-            : 1;
+        return () => undefined;
       } else if (sortingObj.direction == 'ASC') {
         return (l, r) =>

[Survived] ConditionalExpression
hello-world-nest/src/helpers/filter-helper.ts:52:11
     if (sortingObj.isDate) {
       if (sortingObj.direction == 'DESC') {
         return (l, r) =>
-          new Date(l[sortingObj.field]) > new Date(r[sortingObj.field])
+          false
             ? -1
             : 1;

[Survived] EqualityOperator
hello-world-nest/src/helpers/filter-helper.ts:52:11
     if (sortingObj.isDate) {
       if (sortingObj.direction == 'DESC') {
         return (l, r) =>
-          new Date(l[sortingObj.field]) > new Date(r[sortingObj.field])
+          new Date(l[sortingObj.field]) <= new Date(r[sortingObj.field])
             ? -1
             : 1;

[Survived] UnaryOperator
hello-world-nest/src/helpers/filter-helper.ts:53:15
       if (sortingObj.direction == 'DESC') {
         return (l, r) =>
           new Date(l[sortingObj.field]) > new Date(r[sortingObj.field])
-            ? -1
+            ? +1
             : 1;
       } else if (sortingObj.direction == 'ASC') {

[Survived] ConditionalExpression
hello-world-nest/src/helpers/filter-helper.ts:55:18
           new Date(l[sortingObj.field]) > new Date(r[sortingObj.field])
             ? -1
             : 1;
-      } else if (sortingObj.direction == 'ASC') {
+      } else if (false) {
         return (l, r) =>
           new Date(r[sortingObj.field]) > new Date(l[sortingObj.field])

[Survived] ConditionalExpression
hello-world-nest/src/helpers/filter-helper.ts:55:18
           new Date(l[sortingObj.field]) > new Date(r[sortingObj.field])
             ? -1
             : 1;
-      } else if (sortingObj.direction == 'ASC') {
+      } else if (true) {
         return (l, r) =>
           new Date(r[sortingObj.field]) > new Date(l[sortingObj.field])

[Survived] ArrowFunction
hello-world-nest/src/helpers/filter-helper.ts:56:16
             ? -1
             : 1;
       } else if (sortingObj.direction == 'ASC') {
-        return (l, r) =>
-          new Date(r[sortingObj.field]) > new Date(l[sortingObj.field])
-            ? -1
-            : 1;
+        return () => undefined;
       }
     }

[Survived] EqualityOperator
hello-world-nest/src/helpers/filter-helper.ts:57:11
             : 1;
       } else if (sortingObj.direction == 'ASC') {
         return (l, r) =>
-          new Date(r[sortingObj.field]) > new Date(l[sortingObj.field])
+          new Date(r[sortingObj.field]) >= new Date(l[sortingObj.field])
             ? -1
             : 1;

[Survived] ConditionalExpression
hello-world-nest/src/helpers/filter-helper.ts:57:11
             : 1;
       } else if (sortingObj.direction == 'ASC') {
         return (l, r) =>
-          new Date(r[sortingObj.field]) > new Date(l[sortingObj.field])
+          false
             ? -1
             : 1;

[Survived] UnaryOperator
hello-world-nest/src/helpers/filter-helper.ts:58:15
       } else if (sortingObj.direction == 'ASC') {
         return (l, r) =>
           new Date(r[sortingObj.field]) > new Date(l[sortingObj.field])
-            ? -1
+            ? +1
             : 1;
       }
