[Survived] BlockStatement
hello-world-nest/src/helpers/random-helper.ts:2:47
 export class RandomHelper {
-  static getRandomArbitrary(min, max): number {
-    return parseInt(Math.random() * (max - min) + min);
-  }
+  static getRandomArbitrary(min, max): number {}
 
   static getRandomDate(): string {

[Survived] ArithmeticOperator
hello-world-nest/src/helpers/random-helper.ts:3:38
 export class RandomHelper {
   static getRandomArbitrary(min, max): number {
-    return parseInt(Math.random() * (max - min) + min);
+    return parseInt(Math.random() * (max + min) + min);
   }
 

[Survived] ArithmeticOperator
hello-world-nest/src/helpers/random-helper.ts:3:21
 export class RandomHelper {
   static getRandomArbitrary(min, max): number {
-    return parseInt(Math.random() * (max - min) + min);
+    return parseInt(Math.random() / (max - min) + min);
   }
 

[Survived] BlockStatement
hello-world-nest/src/helpers/random-helper.ts:6:34
     return parseInt(Math.random() * (max - min) + min);
   }
 
-  static getRandomDate(): string {
-    const day = this.getRandomArbitrary(1, 31);
-    const month = this.getRandomArbitrary(1, 12);
-    const year = this.getRandomArbitrary(1, 50);
-    return `${year}y${month}m${day}d`;
-  }
+  static getRandomDate(): string {}
 }
 
