[Survived] StringLiteral
hello-world-nest/src/mock/filter-helpers-mocks.ts:4:11
 export const original = {
   members: [
     {
-      id: '5f3411b7bf69de20180ca1bc',
+      id: "",
       fullName: 'Phyllis Sipe',
       dateOfBirth: '7/13/1931',

[Survived] StringLiteral
hello-world-nest/src/mock/filter-helpers-mocks.ts:5:17
   members: [
     {
       id: '5f3411b7bf69de20180ca1bc',
-      fullName: 'Phyllis Sipe',
+      fullName: "",
       dateOfBirth: '7/13/1931',
       medicaId: '9605327155',

[Survived] StringLiteral
hello-world-nest/src/mock/filter-helpers-mocks.ts:8:12
       fullName: 'Phyllis Sipe',
       dateOfBirth: '7/13/1931',
       medicaId: '9605327155',
-      lob: 'MedicaID',
+      lob: "",
       planProduct: 'LTSS',
       timeLob: '1y1m1d',

[Survived] StringLiteral
hello-world-nest/src/mock/filter-helpers-mocks.ts:18:12
       fullName: 'Connie Tressler',
       dateOfBirth: '8/21/1944',
       medicaId: '3305618583',
-      lob: 'MedicaID',
+      lob: "",
       planProduct: 'LTSS',
       timeLob: '1y1m1d',

[Survived] StringLiteral
hello-world-nest/src/mock/filter-helpers-mocks.ts:24:11
       poc: 50,
     },
     {
-      id: '5f047dc6bf69e107b0180c5b',
+      id: "",
       fullName: 'Richard Pyles',
       dateOfBirth: '10/19/1922',

[Survived] StringLiteral
hello-world-nest/src/mock/filter-helpers-mocks.ts:28:12
       fullName: 'Richard Pyles',
       dateOfBirth: '10/19/1922',
       medicaId: '9502282420',
-      lob: 'MedicaID',
+      lob: "",
       planProduct: 'LTSS',
       timeLob: '1y1m1d',

[Survived] StringLiteral
hello-world-nest/src/mock/filter-helpers-mocks.ts:30:16
       medicaId: '9502282420',
       lob: 'MedicaID',
       planProduct: 'LTSS',
-      timeLob: '1y1m1d',
+      timeLob: "",
       poc: 50,
     },

[Survived] ArrayDeclaration
hello-world-nest/src/mock/filter-helpers-mocks.ts:39:16
 export const successFilter = {
   fullName: 'Phyllis Sipe',
   lob: ['MedicaID'],
-  planProduct: ['LTSS'],
+  planProduct: [],
   poc: 50,
   sort: 'ASC',

[Survived] ArrayDeclaration
hello-world-nest/src/mock/filter-helpers-mocks.ts:43:31
   poc: 50,
   sort: 'ASC',
 };
-export const filterResponse = [
-  {
-    id: '5f3411b7bf69de20180ca1bc',
-    fullName: 'Phyllis Sipe',
-    dateOfBirth: '7/13/1931',
-    medicaId: '9605327155',
-    lob: 'MedicaID',
-    planProduct: 'LTSS',
-    timeLob: '1y1m1d',
-    poc: 50,
-  },
-];
+export const filterResponse = [];
 export const filterArrayResponse = [
   {

[Survived] StringLiteral
hello-world-nest/src/mock/filter-helpers-mocks.ts:57:18
 ];
 export const filterArrayResponse = [
   {
-    dateOfBirth: '7/13/1931',
+    dateOfBirth: "",
     fullName: 'Phyllis Sipe',
     id: '5f3411b7bf69de20180ca1bc',

[Survived] StringLiteral
hello-world-nest/src/mock/filter-helpers-mocks.ts:59:9
   {
     dateOfBirth: '7/13/1931',
     fullName: 'Phyllis Sipe',
-    id: '5f3411b7bf69de20180ca1bc',
+    id: "",
     lob: 'MedicaID',
     medicaId: '9605327155',

[Survived] ObjectLiteral
hello-world-nest/src/mock/filter-helpers-mocks.ts:76:3
     poc: 50,
     timeLob: '1y1m1d',
   },
-  {
-    dateOfBirth: '10/19/1922',
-    fullName: 'Richard Pyles',
-    id: '5f047dc6bf69e107b0180c5b',
-    lob: 'MedicaID',
-    medicaId: '9502282420',
-    planProduct: 'LTSS',
-    poc: 50,
-    timeLob: '1y1m1d',
-  },
+  {},
 ];
 export const failFilter = {

[Survived] StringLiteral
hello-world-nest/src/mock/filter-helpers-mocks.ts:81:15
     fullName: 'Richard Pyles',
     id: '5f047dc6bf69e107b0180c5b',
     lob: 'MedicaID',
-    medicaId: '9502282420',
+    medicaId: "",
     planProduct: 'LTSS',
     poc: 50,

[Survived] StringLiteral
hello-world-nest/src/mock/filter-helpers-mocks.ts:88:13
   },
 ];
 export const failFilter = {
-  fullName: 'Alan Turing',
+  fullName: "",
   lob: ['MedicaI'],
   planProduct: ['LTS'],

[Survived] ArrayDeclaration
hello-world-nest/src/mock/filter-helpers-mocks.ts:89:8
 ];
 export const failFilter = {
   fullName: 'Alan Turing',
-  lob: ['MedicaI'],
+  lob: [],
   planProduct: ['LTS'],
   poc: 1,

[Survived] ArrayDeclaration
hello-world-nest/src/mock/filter-helpers-mocks.ts:90:16
 export const failFilter = {
   fullName: 'Alan Turing',
   lob: ['MedicaI'],
-  planProduct: ['LTS'],
+  planProduct: [],
   poc: 1,
   sort: 'DESC',

[Survived] StringLiteral
hello-world-nest/src/mock/filter-helpers-mocks.ts:92:9
   lob: ['MedicaI'],
   planProduct: ['LTS'],
   poc: 1,
-  sort: 'DESC',
+  sort: "",
 };
 export const emptyResult = [];

[Survived] ArrayDeclaration
hello-world-nest/src/mock/filter-helpers-mocks.ts:94:28
   poc: 1,
   sort: 'DESC',
 };
-export const emptyResult = [];
+export const emptyResult = ["Stryker was here"];
 
 export const succesArrayFilters = {

[Survived] StringLiteral
hello-world-nest/src/mock/filter-helpers-mocks.ts:97:9
 export const emptyResult = [];
 
 export const succesArrayFilters = {
-  lob: ['MedicaID', 'Medica'],
+  lob: ["", 'Medica'],
   planProduct: ['LTSS', 'LTE'],
 };

[Survived] ArrayDeclaration
hello-world-nest/src/mock/filter-helpers-mocks.ts:98:16
 
 export const succesArrayFilters = {
   lob: ['MedicaID', 'Medica'],
-  planProduct: ['LTSS', 'LTE'],
+  planProduct: [],
 };
 

[Survived] ArrayDeclaration
hello-world-nest/src/mock/filter-helpers-mocks.ts:103:16
 
 export const failArrayFilters = {
   lob: ['Med', 'Medica'],
-  planProduct: ['SS', 'LTE'],
+  planProduct: [],
 };
 
