[Survived] BlockStatement
hello-world-nest/hello-world-nest/src/main.ts:4:28
 import { NestFactory } from '@nestjs/core';
 import { AppModule } from './app.module';
 
-async function bootstrap() {
-  const app = await NestFactory.create(AppModule);
-  await app.listen(3000);
-}
+async function bootstrap() {}
 bootstrap();
 
